In [23]:
# Load pandas, numpy, regex
import pandas as pd
import numpy as np 
import re
import matplotlib.pyplot as plt


# Load the daily report to a data frame
df = pd.read_json('soal-2.json')

# view the describe dataframe
print(df.describe())

       komoditas berat
count       1054  1054
unique       437   400
top         lele   3kg
freq         192    64

# remove unnecessary string

In [24]:
df2 = df.apply(lambda x: x.str.replace(', ', ' '))

In [25]:
# replace comma with whitespace again
df2 = df2.apply(lambda x: x.str.replace(',', ' '))

In [26]:
df2 = df2.apply(lambda x: x.str.replace('kg', ' '))

In [27]:
# list that will remove on this df
To_remove_lst = ["lele", "bawal", "tongkol", "salem", "rata2", "kembung", "kecuali", "kakap", "nila"]

In [28]:
# remove list using regex (regular expression)
df2['berat'] = df2['berat'].str.replace('|'.join(map(re.escape, To_remove_lst)), '')

In [30]:
# delete ikan string replace with white space
df2 = df2.apply(lambda x: x.str.replace('ikan', ''))

In [31]:
df2['berat'] = df2['berat'].str.split()

In [32]:
df2['komoditas'] = df2['komoditas'].str.split()

In [33]:
df2

                                          komoditas            berat
0                               [lele, bawal, nila]        [6, 1, 1]
1            [kakap, lele, kembung, tongkol, salem]  [2, 1, 1, 1, 1]
2        [nila, kakap, lele, bawal, kembung, salam]           [1, 2]
3             [nila, kembung, tongkol, lele, bawal]  [1, 2, 5, 2, 3]
4     [lele, kerapu, mas, pindang, tongkol, gurame]              [1]
...                                             ...              ...
1049                                         [lele]              [3]
1050                                  [mas, mujaer]           [5, 5]
1051                     [mas, lele, bawal, mujair]              [5]
1052                                [tongkol, nila]           [4, 5]
1053                           [mas, lele, tongkol]              [4]

[1054 rows x 2 columns]

note: 

1. jika datanya dalam bentuk range, disini tidak diangaap atau tidak valid, karena kita tidak bisa menentukan, atau kita ambil pertengahan, 1-5 = 3kg
2. data yang tertukar di-cleansing
3.

In [35]:
print("hello")

hello